[Breacher X2UniversalSoldierClassInfo]
ClassSpecializationTitle="突破手"
ClassSpecializationSummary="当我们需要有人近距离接近变种人，侧翼敌人阵地并将他们从难以到达的地方挖出来时，突破手就是我们的首选战士。"

[Rifleman X2UniversalSoldierClassInfo]
ClassSpecializationTitle="步枪手"
ClassSpecializationSummary="在变种人城市作战，我们的交战距离甚至比大多数外星人入侵前的士兵所习惯的还要短。步枪手利用这一距离，准确无误地将子弹射入敌人弱点中。"

[Trooper X2UniversalSoldierClassInfo]
ClassSpecializationTitle="骑兵"
ClassSpecializationSummary="骑兵是我们防御的中坚力量，他们守护着我们的领土，并保持着他们的阵线。当你不得不撤退时，你需要一名骑兵来帮助你。"

[Machinegunner X2UniversalSoldierClassInfo]
ClassSpecializationTitle="机枪兵"
ClassSpecializationSummary="我相信你很明白，只需一个使用加农炮的机枪兵就能保持对敌人的压制，为队伍的部署赢得时间。"

[Support X2UniversalSoldierClassInfo]
ClassSpecializationTitle="支援兵"
ClassSpecializationSummary="我们的支援士兵配备了各种各样的手榴弹来干扰我们的敌人，掩护他们的小队并控制战场。"

[Marksman X2UniversalSoldierClassInfo]
ClassSpecializationTitle="神射手"
ClassSpecializationSummary="当射手瞄准时，他们的目的就是杀戮，没有别的。把最后一枪的工作交给他们，他们就会是你的王牌。"
